In [3]:
import pandas as pd

In [4]:
# df = pd.read_csv("bank_transactions.csv")
# df=df.drop(columns=['user_id','item_name'])
# df.head()

In [5]:
# data_standardized = (df - df.mean()) / df.std()
# pca = PCA(n_components=2)
# principal_components = pca.fit_transform(data_standardized)
# pc_df = pd.DataFrame(data=principal_components)
# # Explained variance
# explained_variance = pca.explained_variance_ratio_
# print(f"Explained variance by each component: {explained_variance}")

# # Visualizing the principal components
# plt.figure(figsize=(8, 6))
# plt.scatter(pc_df[0],pc_df[1], s=50, c='blue', marker='o')
# plt.xlabel('Principal Component 1')
# plt.ylabel('Principal Component 2')
# plt.title('PCA - 2 Components')
# plt.grid()
# plt.show()

Write a Python function that selects a subset of features from a 
DataFrame based on a list of column names provided as input.

In [6]:
data2 = {
    'id':[1,2,3,4,5],
    'name':['name1','name2','name3','name4','name5'],
    'age':[20,21,19,22,23],
    'city':['city1','city2','city3','city4','city5']
}
data2

{'id': [1, 2, 3, 4, 5],
 'name': ['name1', 'name2', 'name3', 'name4', 'name5'],
 'age': [20, 21, 19, 22, 23],
 'city': ['city1', 'city2', 'city3', 'city4', 'city5']}

In [7]:
df2 = pd.DataFrame(data2)
df2

   id   name  age   city
0   1  name1   20  city1
1   2  name2   21  city2
2   3  name3   19  city3
3   4  name4   22  city4
4   5  name5   23  city5

In [8]:
ip = ['id','name','city']
df2[ip]

   id   name   city
0   1  name1  city1
1   2  name2  city2
2   3  name3  city3
3   4  name4  city4
4   5  name5  city5

Write  a  Python  function  that  creates  a  new  feature 
'transaction_ratio' in a DataFrame. This  feature  is  the  ratio of 
'transaction_amount' to 'account_balance'.

In [9]:
data3 = {
    'transaction_amount':[100,200,300,400,500,110,360,550,450,890],
    'account_balance':[560,450,3030,2300,900,1100,3400,4500,2000,1000]
}
data3

{'transaction_amount': [100, 200, 300, 400, 500, 110, 360, 550, 450, 890],
 'account_balance': [560, 450, 3030, 2300, 900, 1100, 3400, 4500, 2000, 1000]}

In [10]:
df3 = pd.DataFrame(data3)
df3

   transaction_amount  account_balance
0                 100              560
1                 200              450
2                 300             3030
3                 400             2300
4                 500              900
5                 110             1100
6                 360             3400
7                 550             4500
8                 450             2000
9                 890             1000

In [11]:
df3['transaction_ratio'] = df3['transaction_amount'] / df3['account_balance']
df3

   transaction_amount  account_balance  transaction_ratio
0                 100              560           0.178571
1                 200              450           0.444444
2                 300             3030           0.099010
3                 400             2300           0.173913
4                 500              900           0.555556
5                 110             1100           0.100000
6                 360             3400           0.105882
7                 550             4500           0.122222
8                 450             2000           0.225000
9                 890             1000           0.890000